Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/SearchManageApprovers/RegulatorCompanyDetail.*.resx
Languages: cy

# Subheading.OrganisationID
source: Organisation ID
cy: WOrganisation ID

# Subheading.OrganisationType
source: Organisation type
cy: WOrganisation type

# Subheading.RegisteredAddress
source: Registered Address
cy: WRegistered address

# Subheading.CompaniesHouseNumber
source: Companies House Number
cy: WCompanies House number

# Text.NotListed
source: Not listed
cy: WNot listed

# link.CompaniesHouseRegister
source: View on Companies House register
cy: WView on Companies House register

# TabTitle.Contents
source: Contents
cy: WContents

# Tab.ApprovedPerson
source: Approved Person
cy: WApproved person

# Tab.DelegatedPersons
source: Delegated Persons
cy: WDelegated persons

# Tab.AdminUsers
source: Admin Users
cy: WAdmin users

# Tab.BasicUsers
source: Basic Users
cy: WBasic users

# TextAssist.Warning
source: Warning
cy: WWarning

# Text.NoApprovedPerson
source: There is currently no approved person for this organisation
cy: WThere is currently no approved person for this organisation

# Text.NoDelegatedPersons
source: There are no delegated persons for this organisation
cy: WThere are no delegated persons for this organisation

# Text.NoAdminUsers
source: There are no admin users for this organisation
cy: WThere are no admin users for this organisation

# Text.NoBasicUsers
source: There are no basic users for this organisation
cy: WThere are no basic users for this organisation

# Button.NominateNewApprovedPerson
source: Nominate new approved person
cy: WNominate new approved person

# Text.ComplianceScheme
source: Compliance scheme
cy: WCompliance scheme

# Text.DirectProducer
source: Direct producer
cy: WDirect producer

# Text.IndirectProducer
source: Indirect producer
cy: WIndirect producer

# Page.Title
source: Organisation Details
cy: WOrganisation Details
