Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/Applications/EnrolmentRequests.*.resx
Languages: cy

# Page.Title
source: Enrolment Requests
cy: Ceisiadau Ymrestru

# Page.TransferredFrom
source: Transferred from
cy: Wedi’u trosglwyddo o

# Page.Accepted
source: Accepted
cy: Wedi’u derbyn

# Page.Important
source: Important
cy: Pwysig

# Page.To
source: to
cy: i

# Subheading.OrganisationType
source: Organisation type
cy: Math o sefydliad

# Subheading.RegisteredAddress
source: Registered address
cy: Cyfeiriad cofrestredig

# Subheading.CompaniesHouseNumber
source: Companies House number
cy: Rhif Tŷ’r Cwmnïau

# Subheading.RegisteredNation
source: Registered nation:
cy: Gwlad gofrestredig:

# Text.NotListed
source: Not listed
cy: Heb ei restru

# link.CompaniesHouseRegister
source: View on Companies House register
cy: Gweld ar gofrestr Tŷ’r Cwmnïau

# link.TransferToAnotherRegulator
source: Transfer to another environmental regulator
cy: Trosglwyddo i reoleiddiwr amgylcheddol arall

# link.BackToAllApplications
source: Go back to all applications
cy: Yn ôl i bob cais

# RejectedDelegatedPerson
source: You rejected {0} as a delegated person
cy: Rydych chi wedi gwrthod {0} fel person a ddirprwywyd
