Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/Applications/TransferApplication.*.resx
Languages: cy

# Page.Title
source: Transfer {0}?
cy: Trosglwyddo {0}?

# Page.Subtitle
source: You can transfer this application to another agency if you need to.
cy: Cewch drosglwyddo’r cais yma i asiantaeth arall os oes angen ichi wneud hynny.

# Text.TransferDetails
source: Tell us why you’re transferring this application
cy: Dywedwch pam rydych chi’n trosglwyddo’r cais yma

# Text.TransferDetails.Error
source: Select which agency you want to transfer this application to
cy: Dewiswch pa asiantaeth rydych chi’n trosglwyddo’r cais yma iddi

# Text.TransferDetailsSummary.Error
source: Enter why you’re transferring this application
cy: Rhowch pam rydych chi’n trosglwyddo’r cais yma

# Text.TransferDetailsSummaryTooLong.Error
source: Your summary must be 200 characters or less
cy: Rhaid i’ch crynodeb fod yn 200 neu lai o gymeriadau

# Agency.EA
source: Environment Agency (EA)
cy: Asiantaeth yr Amgylchedd (EA)

# Agency.NIEA
source: Northern Ireland Environment (NIEA)
cy: Asiantaeth Amgylchedd Gogledd Iwerddon (NIEA)

# Agency.NRW
source: Natural Resources Wales (NRW)
cy: Cyfoeth Naturiol Cymru (CNC)

# Agency.SEPA
source: Scottish Environment Protection Agency (SEPA)
cy: Asiantaeth Diogelu Amgylchedd yr Alban (SEPA)
