Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/InviteNewApprovedPerson/EnterPersonEmail.*.resx
Languages: cy

# Page.Title
source: What is their email address?
cy: Beth yw eu cyfeiriad ebost nhw?

# Email.HintText
source: An email will be sent to them telling them how to apply to be a nominated person. You will need to accept or reject their application.
cy: Anfonir neges ebost atyn nhw yn dweud sut i wneud cais am fod yn berson a gymeradwywyd. Bydd angen i chithau dderbyn neu wrthod eu cais.

# ErrorSummary.Title
source: There is a problem
cy: Mae yna broblem

# ErrorTitle.NullEmail
source: Enter their email address
cy: Rhowch eu cyfeiriad ebost

# ErrorTitle.InvalidEmail
source: Enter an email in the correct format, like name@example.com
cy: WEnter an email in the correct format, like name example.com 111

# ErrorTitle.InvalidEmailLength
source: Email address must be 254 characters or less
cy: WEmail address must be 254 characters or less

# Email.Label
source: Email
cy: WEmail

# PersonEmail.MissingError
source: Enter their email address
cy: Rhowch eu cyfeiriad ebost

# PersonEmail.TooLongError
source: Email address must be 254 characters or less
cy: WEmail address must be 254 characters or less

# PersonEmail.InvalidFormat
source: Enter an email in the correct format, like name@example.com
cy: WEnter an email in the correct format, like name@example.com 222
