Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/InviteNewApprovedPerson/EnterPersonName.*.resx
Languages: cy

# Page.Title
source: What is the name of the nominated approved person?
cy: WWhat is the name of the nominated approved person?

# LastName.Label
source: Last name
cy: WLast name

# FirstName.Label
source: First name
cy: WFirst name

# ErrorSummary.Title
source: There is a problem
cy: WThere is a problem

# ErrorTitle.FirstNameNull
source: Enter their first name
cy: WEnter their first name

# ErrorTitle.FirstNameDigits
source: First name must not include numbers
cy: WFirst name must not include numbers

# ErrorTitle.FirstNameLength
source: First name must be 35 characters or less
cy: WFirst name must be 35 characters or less

# ErrorTitle.LastNameNull
source: Enter their last name
cy: WEnter their last name

# ErrorTitle.LastNameDigits
source: Last name must not include numbers
cy: WLast name must not include numbers

# ErrorTitle.LastNameLength
source: Last name must be 35 characters or less
cy: WLast name must be 35 characters or less
