Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/Views/Home/LandingPage.*.resx
Languages: cy

# LandingPage.Title
source: pEPR: Regulators’ Service
cy: pEPR: Gwasanaeth i Reoleiddwyr

# LandingPage.ManageAccount
source: Manage your account
cy: Rheoli’ch cyfrif

# LandingPage.ManageAccountDescription
source: Add or remove team members from your account
cy: Ychwanegu neu dynnu aelodau tîm o’ch cyfrif

# LandingPage.ManageApplications
source: Manage applications for approved and delegated people
cy: Rheoli ceisiadau am bobl a gymeradwywyd a phobl a ddirprwywyd

# LandingPage.ManageApplicationsDescription
source: View, accept or reject applications for approved and delegated persons
cy: Gweld, derbyn neu wrthod ceisiadau am bobl a gymeradwywyd a phobl a ddirprwywyd

# LandingPage.ManageSubmissions
source: Manage packaging data submissions
cy: Rheoli cyflwyniadau data pecynwaith

# LandingPage.ManageSubmissionsDescription
source: View, accept or reject packaging data submissions
cy: Gweld, derbyn neu wrthod cyflwyniadau data pecynwaith

# Regulator.Home
source: Regulator home - {0}
cy: Hafan Rheoleiddwyr - {0}

# LandingPage.ManageApprovedPerson
source: Manage organisations and their approved person
cy: WManage organisations and their approved person

# LandingPage.ManageApprovedPersonDescription
source: Remove or invite approved persons
cy: WRemove or invite approved persons
