Repository: DEFRA/epr-regulator-service
Catalog: src/EPR.RegulatorService.Frontend.Web/Resources/SharedResources.*.resx
Languages: cy

# Application.Title
source: pEPR: Regulators’ Service
cy: pEPR: Gwasanaeth i Reoleiddwyr

source: Back
cy: Yn ôl

source: Continue
cy: Parhau

source: Confirm
cy: WConfirm

source: Cancel
cy: Canslo

source: Skip to main content
cy: Neidio i’r prif gynnwys

source: No
cy: Na

source: Yes
cy: Ie

source: Change
cy: Newid

source: or
cy: neu

source: View
cy: Gweld

# Button.Accept
source: Accept
cy: Derbyn

# Button.Reject
source: Reject
cy: Gwrthod

# Tag.Accepted
source: Accepted
cy: Wedi’u derbyn

# Tag.Rejected
source: Rejected
cy: Wedi’u gwrthod

# Tag.Pending
source: Pending
cy: Ar ei hanner

# Custom.BackToHome
source: Back to home
cy: Yn ôl i’r hafan

# Custom.GoToHome
source: Go to home
cy: WGo to home

# Link.LogIntoPowerBI
source: log in to Power BI
cy: mewngofnodwch i Power BI

# Button.Cancel
source: Cancel
cy: Canslo

source: Apply filters
cy: Defnyddio hidlydd

source: Clear filters
cy: Clirio'r hidlyddion

source: Success
cy: Llwyddiant

# Nation.England
source: England
cy: Lloegr

# Nation.Scotland
source: Scotland
cy: Yr Alban

# Nation.Wales
source: Wales
cy: Cymru

# Nation.NorthernIreland
source: Northern Ireland
cy: Gogledd Iwerddon

# CharacterLimit.UnderLimitSingle
source: You have 1 character remaining
cy: Mae gennych chi 1 o gymeriadau ar \xF4l

# CharacterLimit.UnderLimitPlural
source: You have %{count} characters remaining
cy: Mae gennych chi %{count} o gymeriadau ar \xF4l

# CharacterLimit.AtLimit
source: You have 0 characters remaining
cy: Mae gennych chi 0 o gymeriadau ar \xF4l

# CharacterLimit.OverLimitSingle
source: You have 1 character too many
cy: Mae gennych chi 1 o gymeriadau yn ormod

# CharacterLimit.OverLimitPlural
source: You have %{count} characters too many
cy: Mae gennych chi %{count} o gymeriadau yn ormod

# Regulator.CompanyDetail.Telephone
source: Telephone
cy: Ffôn

# Regulator.CompanyDetail.Email
source: Email
cy: Ebost

# Regulator.CompanyDetail.CompanyRole
source: Company role
cy: WCompany role

# Regulator.CompanyDetail.Remove
source: Remove
cy: WRemove

# Regulator.CompanyDetail.EmployeeOfOrganisation
source: Employee of organisation
cy: WEmployee of organisation

# Regulator.CompanyDetail.JobTitle
source: Job title
cy: WJob title

# OrganisationType.DirectProducer
source: Direct Producer
cy: Cynhyrchydd Uniongyrchol

# OrganisationType.ComplianceScheme
source: Compliance scheme
cy: Cynllun cydymffurfio

# Tag.ApprovedPerson
source: Approved Person
cy: Person a gymeradwywyd

# Tag.DelegatedPerson
source: Delegated Person
cy: Person a ddirprwywyd

# Link.Download
source: Download
cy: lawrlwytho

source: Not listed
cy: WNot listed

# CharacterLimit.NoJavaScript
source: You can enter up to 500 characters
cy: WYou can enter up to 500 characters

# RegistrationSubmissionOrganisationType.ComplianceScheme
source: Compliance Scheme
cy: Cynllun cydymffurfio

# RegistrationSubmissionOrganisationType.LargeProducer
source: Large Producer
cy: Cynhyrchydd mawr

# RegistrationSubmissionOrganisationType.NotSpecified
source: Not specified
cy: Heb ei bennu

# RegistrationSubmissionOrganisationType.SmallProducer
source: Small Producer
cy: Cynhyrchydd bach

# RegistrationSubmissionStatus.Cancelled
source: Cancelled
cy: Wedi'i ganslo

# RegistrationSubmissionStatus.Granted
source: Granted
cy: Wedi'i ganiatáu

# RegistrationSubmissionStatus.NotSpecified
source: Not specified
cy: Heb ei bennu

# RegistrationSubmissionStatus.Pending
source: Pending
cy: Ar ei hanner

# RegistrationSubmissionStatus.Queried
source: Queried
cy: Wedi'i gwestiynu

# RegistrationSubmissionStatus.Refused
source: Refused
cy: Wedi'i wrthod

# RegistrationSubmissionStatus.Updated
source: Updated
cy: Wedi'i ddiweddaru

# ServiceRole.ApprovedPerson
source: Approved person
cy: Person wedi'i gymeradwyo

# ServiceRole.DelegatedPerson
source: Delegated person
cy: Person wedi'i ddirprwyo

# ServiceRole.ProducerOther
source: Producer other
cy: Cynhyrchydd - arall

# ServiceRole.RegulatorAdmin
source: Regulator admin
cy: Rheoleiddiwr - gweinyddol

# ServiceRole.RegulatorBasic
source: Regulator basic
cy: Rheoleiddiwr - sylfaenol

# BackToAllSubmissions
source: Go back to all submissions
cy: Ewch yn ôl i bob cyflwyniad

# ManageRegistrationSubmissions.Caption
source: Manage registration submissions
cy: Rheoli cyflwyniadau cofrestru

source: Save and continue
cy: Cadw a pharhau

# Link.BackToSubmissionDetails
source: Go back to submission details
cy: Ewch yn ôl i bob cyflwyniad

# PaymentValidation.FormatIsInvalid
source: Amount can only include pounds and pence.
cy: Rhaid i'r swm gynnwys punnoedd a cheiniogau yn unig

# PaymentValidation.InvalidCharacters
source: Enter a valid number
cy: Rhowch rif dilys

# PaymentValidation.NonNumericCharacters
source: Amount must be a number
cy: Rhaid i'r swm fod yn rhif

# PaymentValidation.TheAmountIsRequired
source: Enter an amount
cy: Rhowch swm

# PaymentValidation.ValueCannotBeZero
source: Amount cannot be zero
cy: Chaiff y swm ddim bod yn sero

# PaymentValidation.ValueIsTooHigh
source: Amount must be less than £10,000,000
cy: Rhaid i'r swm fod yn llai na £10,000,000

# PaymentDetail.OfflinePaymentDetailsHint
source: Include details of any offline payments, for example, £600.00 or £193.54. Adjustments can also be added, including for negative amounts.
cy: Cynhwyswch fanylion taliadau all-lein yma, er enghraifft £600 neu £193.54. Gall addasiadau gael eu hychwanegu hefyd, gan gynnwys symiau negyddol.

# PaymentDetail.OfflinePaymentDetailsSubmit
source: Submit offline payment
cy: Cyflwyno taliad all-lein

# PaymentDetail.OfflinePaymentDetailsTitle
source: Offline payment details
cy: Manylion taliadau all-lein
